# SQLite with Python

See: https://pythonspot.com/sqlite-database-with-pandas/

## Create SQLite Database

In [1]:
import sqlite3

connection = sqlite3.connect('data/population.db')
cursor = connection.cursor()

In [2]:
# delete mydatabase if the table exists from previous run of this notebook 
# so that we have a clean start when we run this notebook again from the top

try:
    cursor.execute('DROP TABLE Population')
except sqlite3.Error as error:
    print(error)
finally:
    print('All good')
    
with connection:
    cursor = connection.cursor()    
    cursor.execute("CREATE TABLE Population(id INTEGER PRIMARY KEY, country TEXT, population INT)")
    cursor.execute("INSERT INTO Population VALUES(NULL,'Germany',81197537)")
    cursor.execute("INSERT INTO Population VALUES(NULL,'France', 66415161)")
    cursor.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")
    cursor.execute("INSERT INTO Population VALUES(NULL,'Italy', 60795612)")
    cursor.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")

All good

In [3]:
# conda install -c conda-forge ipython-sql
# conda install -c anaconda sqlalchemy

%load_ext sql
%sql sqlite:///data/population.db
%sql SELECT country FROM Population WHERE population > 50000000;

 * sqlite:///data/population.db
Done.

[('Germany',), ('France',), ('Italy',)]

## Querying SQLite Database

In [4]:
import pandas as pd

query = "SELECT country FROM Population WHERE population > 50000000;"

df = pd.read_sql_query(query, connection)

for country in df['country']:
    print(country)
    
df.head()

Germany
France
Italy

   country
0  Germany
1   France
2    Italy

## SQLite to Python Panda Dataframe

In [5]:
query = "SELECT country FROM Population WHERE population > 50000000;"
df = pd.read_sql_query(query, connection)
for country in df['country']:
    print(country)

Germany
France
Italy

In [6]:
df = pd.read_sql_query(query, connection)
df.head()

   country
0  Germany
1   France
2    Italy

In [7]:
cursor.close()